In [440]:
from datetime import datetime, date
import os
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import text

In [442]:
 #Load NYC Subway Monthly Ridership Data
nyc_data = pd.read_csv('PublicTransitDatabase/MTA_Monthly_Ridership___Traffic_Data__Beginning_January_2008.csv')
nyc_data.head()

        Month Agency   Ridership
0  2008-01-01    MNR   6453734.0
1  2008-02-01    MNR   6144377.0
2  2008-03-01    MNR   6602280.0
3  2008-04-01    B&T  24900328.0
4  2008-04-01    MNR   6787480.0

In [444]:
nyc_data['Agency'].value_counts()

Agency
MNR         203
B&T         129
Subway       83
AAR          71
BT           71
LIRR         71
MTA Bus      71
NYCT Bus     71
SIR          71
Bus          12
Name: count, dtype: int64

In [446]:
# Transform NYC Data
#Convert Agency to either bus or metro
nyc_data['city'] = 'New York'
nyc_data['transportation_type'] = nyc_data['Agency'].apply(
    lambda x: 'bus' if 'bus' in x.lower() else 'metro'
)

In [448]:
nyc_data_cleaned = nyc_data.rename(columns={'Ridership': 'ridership_count', 'Month': 'month'}, inplace=True)
nyc_data_cleaned = nyc_data[['month', 'city', 'transportation_type', 'ridership_count']]

In [450]:
nyc_data_cleaned.head()

        month      city transportation_type  ridership_count
0  2008-01-01  New York               metro        6453734.0
1  2008-02-01  New York               metro        6144377.0
2  2008-03-01  New York               metro        6602280.0
3  2008-04-01  New York               metro       24900328.0
4  2008-04-01  New York               metro        6787480.0

In [453]:
# Load Chicago CTA Data
cta_data = pd.read_csv('PublicTransitDatabase/CTA_-_Ridership_-_Daily_Boarding_Totals_20241204.csv')
cta_data.head()

  service_date day_type     bus  rail_boardings  total_rides
0   01/01/2001        U  297192          126455       423647
1   01/02/2001        W  780827          501952      1282779
2   01/03/2001        W  824923          536432      1361355
3   01/04/2001        W  870021          550011      1420032
4   01/05/2001        W  890426          557917      1448343

In [455]:
#Convert Cta values to datetime
cta_data['service_date'] = pd.to_datetime(cta_data['service_date'], errors='coerce')

In [457]:
cta_cleaned = cta_data.set_index('service_date').resample('MS').sum().reset_index()

In [505]:
# Transform CTA Data
cta_cleaned = cta_cleaned.loc[:,['service_date', 'bus', 'rail_boardings']]\
.rename({'rail_boardings': 'metro' ,'service_date': 'month'}, axis=1)\
.melt(id_vars='month',
value_vars=[ 'bus', 'metro'],
var_name= 'transportation_type', value_name= 'ridership_count'
                                       )

KeyError: "None of [Index(['service_date', 'bus', 'rail_boardings'], dtype='object')] are in the [columns]"

In [461]:
cta_cleaned['city'] = 'Chicago'

In [463]:
cta_cleaned.head()

       month transportation_type  ridership_count     city
0 2001-01-01                 bus         25022908  Chicago
1 2001-02-01                 bus         23768892  Chicago
2 2001-03-01                 bus         26827165  Chicago
3 2001-04-01                 bus         25053791  Chicago
4 2001-05-01                 bus         26743744  Chicago

In [477]:
# Combine Data
combined_data = pd.concat([nyc_data_cleaned, cta_cleaned])

In [479]:
combined_data.to_sql(name='monthly_totals', con=engine, index=False, if_exists='replace')

423

In [481]:
#Create engine to export to postgresql

engine = create_engine('postgresql+psycopg2://postgres:postgresql@localhost/postgres')

In [483]:
engine

Engine(postgresql+psycopg2://postgres:***@localhost/postgres)

In [491]:
# with engine.connect() as conn:
#     conn.execute(create_table_query)

In [493]:
with engine.connect() as con:
    for transportation_type in ['bus', 'metro']:
        sql_query = text(f"""
        CREATE TABLE IF NOT EXISTS monthly_totals (
        month DATE NOT NULL,
        city VARCHAR(50) NOT NULL,
        transportation_type VARCHAR(20) NOT NULL,
        ridership_count INT NOT NULL
    );
    """)
        con.execute(sql_query)
        con.commit()

In [497]:
with engine.connect() as con:
    for transportation_type in ['bus', 'metro']:
        sql_query = text(f'''
        CREATE TABLE IF NOT EXISTS bus_monthly_totals AS
        SELECT
            month,
            city,
            transportation_type,
            ridership_count
        FROM
            monthly_totals
        WHERE
            transportation_type = 'bus';'''
)
        con.execute(sql_query)
        con.commit()

In [499]:
with engine.connect() as con:
    for transportation_type in ['bus', 'metro']:
        sql_query = text(f'''
        CREATE TABLE IF NOT EXISTS metro_monthly_totals AS
        SELECT
            month,
            city,
            transportation_type,
            ridership_count
        FROM
            monthly_totals
        WHERE
            transportation_type = 'metro';
            '''
)
        con.execute(sql_query)
        con.commit()

In [501]:
pd.read_sql('SELECT * FROM bus_monthly_totals LIMIT 5', engine)

        month      city transportation_type  ridership_count
0  2018-01-01  New York                 bus       45398837.0
1  2018-02-01  New York                 bus       44719811.0
2  2018-03-01  New York                 bus       49751875.0
3  2018-04-01  New York                 bus       48544481.0
4  2018-05-01  New York                 bus       51833732.0

In [503]:
pd.read_sql('SELECT * FROM metro_monthly_totals LIMIT 5', engine)

        month      city transportation_type  ridership_count
0  2008-01-01  New York               metro        6453734.0
1  2008-02-01  New York               metro        6144377.0
2  2008-03-01  New York               metro        6602280.0
3  2008-04-01  New York               metro       24900328.0
4  2008-04-01  New York               metro        6787480.0